Revit 2026 API

# NoiseNoiseColor2 Property

---

The property labeled "Color 2" from the "Noise" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string NoiseColor2 { get; }
```
```vb
Public Shared ReadOnly Property NoiseColor2 As String
	Get
```
```cpp
public:
static property String^ NoiseColor2 {
	String^ get ();
}
```
```fsharp
static member NoiseColor2 : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Noise Class

Autodesk.Revit.DB.Visual Namespace